# ML1 LAB01 16/04/2022
## 21BDA35 - Nakul Ramesh Varma

 

## Python Datatypes and Datastructures

In [1]:
type(5)

int

In [2]:
type(5.5)

float

In [3]:
type("Hello")

str

In [4]:
type(True)

bool

In [5]:
type(5j)

complex

In [6]:
type([1,2,3,4,5])

list

In [7]:
type((1,2,3,4,5))

tuple

In [8]:
type({"a": 1, "b": 2})

dict

## Operators and Indexing

In [9]:
sample_list = ['hello','hi','cool','me']

In [10]:
sample_list[3]

'me'

In [11]:
sample_list[0]

'hello'

In [12]:
sample_list[2]+sample_list[3]  # concatenation

'coolme'

In [13]:
1+3

4

## Loops and iterations

In [14]:
for i in range(5):
    print(i)

0
1
2
3
4

In [15]:
for word in sample_list:
    print(word)

hello
hi
cool
me

In [16]:
for i in range(len(sample_list)):
    print(sample_list[i])

hello
hi
cool
me

## if-else statements

In [17]:
if "hello" in sample_list:
    print("Yes")
else:
    print("No")

Yes

## Functions

In [18]:
def foo_coolguy(name):
    print(name, "is a cool guy!!!!")

In [19]:
foo_coolguy("Nakul")

Nakul is a cool guy!!!!

## Python for DataScience

In [20]:
import pandas as pd
import numpy as np

In [21]:
randnums = np.random.randint(10, size = 10)

In [22]:
randnums

array([3, 2, 7, 4, 1, 5, 7, 4, 9, 5])

In [23]:
randnum_series = pd.Series(randnums)

In [24]:
randnum_series

0    3
1    2
2    7
3    4
4    1
5    5
6    7
7    4
8    9
9    5
dtype: int32

In [25]:
randnum_series.index

RangeIndex(start=0, stop=10, step=1)

In [26]:
randnum_series.values

array([3, 2, 7, 4, 1, 5, 7, 4, 9, 5])

In [27]:
randnum_series.value_counts()

7    2
4    2
5    2
3    1
2    1
1    1
9    1
dtype: int64

In [28]:
sample_df = pd.DataFrame([randnums,randnums]).T

In [29]:
sample_df

   0  1
0  3  3
1  2  2
2  7  7
3  4  4
4  1  1
5  5  5
6  7  7
7  4  4
8  9  9
9  5  5

In [30]:
sample_df.columns = ["randomnum01", "randomnum02"]

In [31]:
sample_df

   randomnum01  randomnum02
0            3            3
1            2            2
2            7            7
3            4            4
4            1            1
5            5            5
6            7            7
7            4            4
8            9            9
9            5            5

In [32]:
df = pd.read_csv("admission_predict.csv")

In [33]:
df

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65
...,...,...,...,...,...,...,...,...,...
395,396,324,110,3,3.5,3.5,9.04,1,0.82
396,397,325,107,3,3.0,3.5,9.11,1,0.84
397,398,330,116,4,5.0,4.5,9.45,1,0.91
398,399,312,103,3,3.5,4.0,8.78,0,0.67
399,400,333,117,4,5.0,4.0,9.66,1,0.95

In [34]:
df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [35]:
df.tail()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
395,396,324,110,3,3.5,3.5,9.04,1,0.82
396,397,325,107,3,3.0,3.5,9.11,1,0.84
397,398,330,116,4,5.0,4.5,9.45,1,0.91
398,399,312,103,3,3.5,4.0,8.78,0,0.67
399,400,333,117,4,5.0,4.0,9.66,1,0.95

In [36]:
df.shape

(400, 9)

In [37]:
df["GRE Score"].value_counts()

324    19
312    19
316    14
322    14
314    14
325    13
321    13
311    12
317    12
327    12
320    12
326    11
313    11
308    11
323    10
315    10
300     9
329     9
319     9
318     9
340     8
310     8
301     8
299     8
304     8
331     8
307     8
305     8
298     7
334     7
332     6
328     6
306     6
309     6
330     6
336     5
296     5
303     5
302     5
335     4
295     4
338     4
297     4
333     4
339     3
294     2
290     2
337     1
293     1
Name: GRE Score, dtype: int64

In [38]:
df.isna().sum()

Serial No.           0
GRE Score            0
TOEFL Score          0
University Rating    0
SOP                  0
LOR                  0
CGPA                 0
Research             0
Chance of Admit      0
dtype: int64

In [39]:
df.describe()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
count,400.000000,400.000000,400.000000,400.000000,400.000000,400.000000,400.000000,400.000000,400.000000
mean,200.500000,316.807500,107.410000,3.087500,3.400000,3.452500,8.598925,0.547500,0.724350
std,115.614301,11.473646,6.069514,1.143728,1.006869,0.898478,0.596317,0.498362,0.142609
min,1.000000,290.000000,92.000000,1.000000,1.000000,1.000000,6.800000,0.000000,0.340000
25%,100.750000,308.000000,103.000000,2.000000,2.500000,3.000000,8.170000,0.000000,0.640000
50%,200.500000,317.000000,107.000000,3.000000,3.500000,3.500000,8.610000,1.000000,0.730000
75%,300.250000,325.000000,112.000000,4.000000,4.000000,4.000000,9.062500,1.000000,0.830000
max,400.000000,340.000000,120.000000,5.000000,5.000000,5.000000,9.920000,1.000000,0.970000

In [40]:
df.corr()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,1.000000,-0.097526,-0.147932,-0.169948,-0.166932,-0.088221,-0.045608,-0.063138,0.042336
GRE Score,-0.097526,1.000000,0.835977,0.668976,0.612831,0.557555,0.833060,0.580391,0.802610
TOEFL Score,-0.147932,0.835977,1.000000,0.695590,0.657981,0.567721,0.828417,0.489858,0.791594
University Rating,-0.169948,0.668976,0.695590,1.000000,0.734523,0.660123,0.746479,0.447783,0.711250
SOP,-0.166932,0.612831,0.657981,0.734523,1.000000,0.729593,0.718144,0.444029,0.675732
LOR,-0.088221,0.557555,0.567721,0.660123,0.729593,1.000000,0.670211,0.396859,0.669889
CGPA,-0.045608,0.833060,0.828417,0.746479,0.718144,0.670211,1.000000,0.521654,0.873289
Research,-0.063138,0.580391,0.489858,0.447783,0.444029,0.396859,0.521654,1.000000,0.553202
Chance of Admit,0.042336,0.802610,0.791594,0.711250,0.675732,0.669889,0.873289,0.553202,1.000000